"""
    문제
        사용자로부터 정수를 입력받아, 그 크기만큼 '#' 문자로 직각삼각형을 출력하는 프로그램을 작성하시오.

    요구사항
        1. 반복문(for과 while)을 사용하여 작성하시오.
        2. 삼각형을 출력하는 핵심 로직은 별도의 함수로 구현하시오.
        3. 함수의 매개변수(parameter)로 삼각형의 크기를 전달받도록 하시오.
        4. 함수 내부에서 '#' 문자를 사용하여 삼각형을 출력하시오.

    출력 예시:
        (우측 정렬) 직각삼각형의 크기를 입력하세요: 10

                          # 
                        # # 
                      # # # 
                    # # # # 
                  # # # # # 
                # # # # # # 
              # # # # # # # 
            # # # # # # # # 
          # # # # # # # # # 
        # # # # # # # # # # 
"""

num = int(input("정삼각형의 크기를 입력하세요: "))
def triangle():
  text = "# "
  add_text = 1
  for i in range(num,0,-1):
    print(" "*(i), end="")
    print(text*add_text)
    add_text += 1
triangle()