"""
    문제
        사용자로부터 출력할 단을 입력받아 해당 구구단을 출력하는 프로그램을 작성하시오.
            - 앞의 숫자: 피승수(被乘數) 또는 곱해지는 수 (multiplicand, dan)
            - 뒤의 숫자: 승수(乘數) 또는 곱하는 수 (multiplier, num)
        
    요구사항
        1. 함수 정의: 단을 매개변수(parameter)로 받아 해당 구구단을 출력하는 함수를 정의하고, for 문을 활용하여 구현할 것
        2. 입력 처리: 사용자로부터 단을 입력받아 해당 함수에 인수로 전달하여 실행할 것
        3. 예외 처리: 2~9 이외의 숫자나 문자가 입력된 경우, 오류 메시지를 출력하고 프로그램을 즉시 종료할 것
        
    출력 예시:
        [ 구구단 프로그램 ]
            원하는 단을 입력하세요 (2 ~ 9): 2

        2 x 1 = 2
        2 x 2 = 4
        2 x 3 = 6
        2 x 4 = 8
        2 x 5 = 10
        2 x 6 = 12
        2 x 7 = 14
        2 x 8 = 16
        2 x 9 = 18

        --- --- ---

        [ 구구단 프로그램 ]
            원하는 단을 입력하세요 (2 ~ 9): A

        잘못된 입력입니다. 프로그램을 종료합니다.
"""
def main():
    msg = """
    [ 구구단 프로그램 ]
                원하는 단을 입력하세요 (2 ~ 9): """
    try:
        dan = int(input(msg))
        if dan not in range(2,10):
            print("잘못된 입력입니다. 프로그램을 종료합니다.")
            exit()

        for num in range(1, 10):
            print(f'{dan} x {num} = {dan*num}')
        return 0
    
    except Exception as error:
        print("잘못된 입력입니다. 프로그램을 종료합니다.")
    

if __name__ == "__main__":
    main()