"""
    문제
        사용자로부터 특정 단 출력 또는 전체 구구단(2 ~ 9단) 출력 중 하나를 선택받아 실행하는 프로그램을 작성하시오.

    요구사항
        1. 입력 처리: 
            - 사용자로부터 특정 단 출력 또는 전체 구구단(2 ~ 9단) 출력 중 하나를 선택받아 실행할 것
            - "특정 단 출력"을 선택하는 경우 단을 입력받아 해당 함수에 인수로 전달하여 실행할 것
        2. 함수 정의: 단을 매개변수(parameter)로 받아 해당 구구단을 출력하는 함수를 정의하고, for 문을 활용하여 구현할 것
        3. 예외 처리: 
            - "1. 특정 단 출력" 또는 "2. 전체 출력 (2단 ~ 9단)" 이외의 숫자나 문자가 입력된 경우, 오류 메시지를 출력하고 프로그램을 즉시 종료할 것
            - "1. 특정 단 출력"를 선택하는 경우 2 ~ 9 이외의 숫자나 문자가 입력된 경우, 오류 메시지를 출력하고 프로그램을 즉시 종료할 것

    출력 예시:
        [ 구구단 프로그램 ]
            1. 특정 단 출력
            2. 전체 출력 (2단 ~ 9단)
            원하는 번호를 선택하세요 (1 또는 2):

            1번 선택:
                원하는 단을 입력하세요 (2 ~ 9): 2

                2x1 = 2 
                2x2 = 4 
                2x3 = 6 
                2x4 = 8 
                2x5 = 10
                2x6 = 12
                2x7 = 14
                2x8 = 16
                2x9 = 18

            2번 선택:
                2x1 = 2   3x1 = 3   4x1 = 4   5x1 = 5   
                2x2 = 4   3x2 = 6   4x2 = 8   5x2 = 10   
                2x3 = 6   3x3 = 9   4x3 = 12   5x3 = 15   
                2x4 = 8   3x4 = 12   4x4 = 16   5x4 = 20   
                2x5 = 10   3x5 = 15   4x5 = 20   5x5 = 25   
                2x6 = 12   3x6 = 18   4x6 = 24   5x6 = 30   
                2x7 = 14   3x7 = 21   4x7 = 28   5x7 = 35   
                2x8 = 16   3x8 = 24   4x8 = 32   5x8 = 40   
                2x9 = 18   3x9 = 27   4x9 = 36   5x9 = 45   


                6x1 = 6   7x1 = 7   8x1 = 8   9x1 = 9   
                6x2 = 12   7x2 = 14   8x2 = 16   9x2 = 18   
                6x3 = 18   7x3 = 21   8x3 = 24   9x3 = 27   
                6x4 = 24   7x4 = 28   8x4 = 32   9x4 = 36   
                6x5 = 30   7x5 = 35   8x5 = 40   9x5 = 45   
                6x6 = 36   7x6 = 42   8x6 = 48   9x6 = 54   
                6x7 = 42   7x7 = 49   8x7 = 56   9x7 = 63   
                6x8 = 48   7x8 = 56   8x8 = 64   9x8 = 72   
                6x9 = 54   7x9 = 63   8x9 = 72   9x9 = 81 
"""

user_msg = """
[ 구구단 프로그램 ]
1. 특정 단 출력
2. 전체 출력 (2단 ~ 9단)
원하는 번호를 선택하세요 (1 또는 2): """

def print_dan(dan:int):
    for num in range(1, 10):
        print(f'{dan} x {num} = {dan*num}')

def print_all():
    for i in range(1, 10):
        col = 0
        for dan in range(2,6):
            print(f'{dan} x {i} = {dan*i:<8}', end=" ")
            col += 1
            if col > 3:
                col = 0
                print()
    print()
    for i in range(1,10):
        col = 0
        for dan in range(6,10):
            print(f'{dan} x {i} = {dan*i:<8}', end=" ")
            col += 1
            if col > 3:
                col = 0
                print()

def main():
    try:
        choice = input(user_msg)
        
        match choice:
            case "1":
                dan = int(input("원하는 단을 입력하세요 (2~9): "))
                if dan not in range(2,10):
                    print("잘못된 입력입니다. 프로그램을 종료합니다.")
                    exit()
                print_dan(dan)
            case "2":
                print_all()
            case _:
                print("잘못된 입력입니다. 프로그램을 종료합니다.")
                exit()
    except Exception as error:
        print("잘못된 입력입니다. 프로그램을 종료합니다.")
        exit()

if __name__ == "__main__":
    main()